//Вывести на экран последнюю цифру целого числа введенного с клавиатуры.
int a=5018934;
int b=a%10;
System.Console.WriteLine(b);
