//Вывести на экран числа от -N до N
int i=-38;
int N=38;
while(i<=N)
{
    System.Console.WriteLine(i);
    i++;
}
