//Вывести на экран числа от -N до N
int i=-28;
int N=28;
while(i<=N)
{
    System.Console.WriteLine(i);
    i++;
}

